In [3]:
import pandas as pd
employee_df = pd.read_csv("employee.csv")
employee_df

   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [4]:
department_df = pd.read_csv("department.csv")
department_df

   id   name
0   1     IT
1   2  Sales

In [5]:
# Merge the two dataframes on departmentId to get the department name for each employee
merged_df = employee_df.merge(department_df, left_on="departmentId", right_on="id")
merged_df

   id_x name_x  salary  departmentId  id_y name_y
0     1    Joe   70000             1     1     IT
1     2    Jim   90000             1     1     IT
2     5    Max   90000             1     1     IT
3     3  Henry   80000             2     2  Sales
4     4    Sam   60000             2     2  Sales

In [6]:
# Group the merged dataframe by department name and find the employee with the highest salary in each group
highest_salary_employees = merged_df.groupby('name_y').apply(lambda x: x[x['salary'] == x['salary'].max()])
highest_salary_employees

          id_x name_x  salary  departmentId  id_y name_y
name_y
IT     1     2    Jim   90000             1     1     IT
       2     5    Max   90000             1     1     IT
Sales  3     3  Henry   80000             2     2  Sales

In [7]:
# Select the relevant columns and rename them
result_df = highest_salary_employees[['name_y', 'name_x', 'salary']]
result_df.columns = ['Department', 'Employee', 'Salary']

# Reset the index and drop the unnecessary level
result_df.reset_index(drop=True, inplace=True)
result_df

  Department Employee  Salary
0         IT      Jim   90000
1         IT      Max   90000
2      Sales    Henry   80000